Public Member Functions | List of all members
API_IEventHandler Class Referenceabstract
Notifications Manager
Defining an interface for all event handlers. More...
#include <APIdefs_Callback.h>
 Inheritance diagram for API_IEventHandler:
 Public Member Functions
virtual GS::UniString  | GetName () const =0
virtual void  | Dispatch (const API_IEventNotifier &eventNotifier) const =0
It dispatches the event.
Detailed Description
Defining an interface for all event handlers.
Since
Archicad 26
Member Function Documentation
◆ Dispatch()
 virtual void API_IEventHandler::Dispatch  |  ( |  const API_IEventNotifier &  |  eventNotifier | ) |   const
pure virtual
It dispatches the event.
Parameters
eventNotifier | The occurrence of an event can be notified via this parameter.
Implemented in API_IAttributeEventHandler, API_IAttributeFolderEventHandler, API_IClassificationSystemEventHandler, API_IClassificationItemEventHandler, API_IPropertyGroupEventHandler, API_IPropertyDefinitionEventHandler, API_IGraphisoftIDEventHandler, API_IEnableAllInfoDialogEventHandler, API_IMarqueeEventHandler, API_IWindowEventHandler, ACAPI::API_IKeynoteItemEventHandler, and ACAPI::API_IKeynoteFolderEventHandler.
◆ GetName()
 virtual GS::UniString API_IEventHandler::GetName  |  ( |   | ) |   const
pure virtual
Returns
Human readable name of the event handler.
Implemented in API_IAttributeEventHandler, API_IAttributeFolderEventHandler, API_IClassificationSystemEventHandler, API_IClassificationItemEventHandler, API_IPropertyGroupEventHandler, API_IPropertyDefinitionEventHandler, API_IGraphisoftIDEventHandler, API_IEnableAllInfoDialogEventHandler, API_IMarqueeEventHandler, API_IWindowEventHandler, ACAPI::API_IKeynoteItemEventHandler, and ACAPI::API_IKeynoteFolderEventHandler.